notes/notmuch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notmuch</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://www.haider.gq/base/style.css'/> 
<link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css' /> 
<link rel='preconnect' href='https://fonts.googleapis.com'> 
<link rel='preconnect' href='https://fonts.gstatic.com' crossorigin> 
<link href='https://fonts.googleapis.com/css2?family=Poppins:ital@1&family=Roboto&display=swap' rel='stylesheet'>
<link href='https://fonts.googleapis.com/css2?family=JetBrains+Mono&display=swap' rel='stylesheet'>
<meta name='keywords' content='development, coding, programming, linux, emacs, guix'>
<link rel='icon' type='image/x-icon' href='/base/favicon.png'>
<meta name='description' content="Haider Mirza's website">
</head>
<body>
<div id="preamble" class="status">
<div class='grid-container'>
      <div class='grid-item header'>

	<a href='https://www.haider.gq' class='Header_Title'>
	  <span class='Header_Haider-Mirza'>Haider Mirza</span>
	</a>
	<ul class='Header_links'>
	  <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	  <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	  <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	</ul>
	<input type='search' class='Sidebar_Search' placeholder='Search Posts...'>
	</div>

	<div class='grid-item main'>
	  <input type='search' class='Main_Search' placeholder='Search Posts...'>
	      <div class='main-main'> <!-- The actual main part -->
</div>
<div id="content" class="content">
<h1 class="title">Notmuch</h1>

<div id="outline-container-orgad1c1f1" class="outline-2">
<h2 id="orgad1c1f1">About</h2>
<div class="outline-text-2" id="text-orgad1c1f1">
<p>
Notmuch is just a email system that is incredibly fast and is based off tagging.
Notmuch also has a <a target='_blank' rel='noopener noreferrer' class='external' href="https://notmuchmail.org/">website</a>.
</p>

<p>
You can find my configuration in my <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/Haider-Mirza/Dotfiles">Dotfiles repository</a> (I use Notmuch's <a href="emacs.html#ID-f8b81c21-7c7e-410e-82ad-046fa5fa4c55">Emacs</a> frontend).
Note that this has been <b>highly configured</b> to my needs and is not made to be a drop-in-replacement for you; It's just a reference.
My personal email is rerouted using an <a href="alias.html#ID-9bdbfb80-de50-4731-9ae8-d313029021d3">alias</a> that is managed by <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.cloudflare.com/">Cloudflare</a>.
</p>
</div>
</div>

<div id="outline-container-orgbf24c97" class="outline-2">
<h2 id="orgbf24c97">How to attach a file</h2>
<div class="outline-text-2" id="text-orgbf24c97">
<p>
The way is the exact same to how you do it in <a href="mu4e.html#ID-d71d294a-b8e3-48e3-8295-3d373bcd9681">Mu4e</a>.
When composing, go into the text area and do the command C-c C-a to attach a file.
</p>
</div>
</div>

<div id="outline-container-org01d7e54" class="outline-2">
<h2 id="org01d7e54">Links to this note</h2>
<div class="outline-text-2" id="text-org01d7e54">
<ul class="org-ul">
<li><a href="./emacs_packages.html">Emacs Packages</a></li>
<li><a href="./mu4e.html">Mu4e</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
</div>
		    </div>
		<div class='grid-item sidebar'>
		  <h2>Socials</h2>
		  <ul class='sidebar-socials'>
		    <li><a href='mailto:haider@haider.gq'><i class='fa-solid fa-envelope'></i> Email</a></li>
		    <li class='irc' onclick='alert('My Username is Haider,
You can find me in Libera.Chat on these channels:
- #tropin 
- #systemcrafters 
- #guix');'><i class='fa-solid fa-message'></i> IRC/Matrix</li>
		    <li><a href='https://www.github.com/Haider-Mirza'><i class='fa-brands fa-github'></i> Github</a></li>
		  </ul>
		  <h2>Projects</h2>
		  <ul class='sidebar-projects'>
		    <li><a href='https://www.github.com/Haider-Mirza/Spinter'> Spinter</a></li>
		  </ul>
		</div>
		<div class='grid-item footer'>
		  <p>Created by Haider Mirza with orgmode in emacs</p>
		</div>
	      </div>
</div>
</body>
</html>
